joakimeriksson/cooja-ng/src/arm/cc2538_rfcore.c
/*
 * CC2538 RF Core — 802.15.4 radio
 *
 * M1: Frame parsing, interrupt generation, frame-based TX/RX.
 */
#include "cc2538_rfcore.h"
#include "arm_nvic.h"
#include <string.h>
#include <stdbool.h>
#include <stdio.h>

/* Register region sizes */
#define RFCORE_FFSM_SIZE  0x600
#define RFCORE_XREG_SIZE  0x200
#define RFCORE_SFR_SIZE   0x100

/* 802.15.4 PHY constants */
#define IEEE802154_SFD  0x7A
#define PREAMBLE_MIN    4

/* ================================================================
 * CRC — CCITT-16 with bit reversal (matches CC2420 wire format)
 * ================================================================ */

static uint8_t bitrev(uint8_t data) {
    return (uint8_t)(
        ((data << 7) & 0x80) | ((data << 5) & 0x40) |
        ((data << 3) & 0x20) | ((data << 1) & 0x10) |
        ((data >> 7) & 0x01) | ((data >> 5) & 0x02) |
        ((data >> 3) & 0x04) | ((data >> 1) & 0x08)
    );
}

static uint16_t crc_add(uint16_t crc, uint8_t data) {
    uint16_t newcrc = ((crc >> 8) & 0xff) | ((crc << 8) & 0xffff);
    newcrc ^= data;
    newcrc ^= (newcrc & 0xff) >> 4;
    newcrc ^= (newcrc << 12) & 0xffff;
    newcrc ^= (newcrc & 0xff) << 5;
    return newcrc & 0xffff;
}

static uint16_t crc_add_bitrev(uint16_t crc, uint8_t data) {
    return crc_add(crc, bitrev(data));
}

/* MAC timer runs at 32.768 kHz — period in nanoseconds */
#define MT_PERIOD_NS  30517  /* 1e9 / 32768 */

/* --- Interrupt helper --- */

static void rfcore_check_interrupts(cc2538_rfcore_t *rf) {
    uint32_t masked0 = rf->rfirqf0 & rf->rfirqm0;
    uint32_t masked1 = rf->rfirqf1 & rf->rfirqm1;
    if (masked0 || masked1)
        arm_nvic_set_pending(rf->nvic, RFCORE_RX_TX_IRQ);
    if (rf->rferrf & rf->rferrm)
        arm_nvic_set_pending(rf->nvic, RFCORE_ERR_IRQ);
}

/* --- State management --- */

static void rfcore_set_state(cc2538_rfcore_t *rf, rf_state_t state) {
    rf->state = state;
    switch (state) {
        case RF_STATE_IDLE:
            rf->fsmstat1 = 0;
            break;
        case RF_STATE_RX_CALIBR:
        case RF_STATE_SFD_WAIT:
        case RF_STATE_RX:
            rf->fsmstat1 = (1 << 0)   /* RX_ACTIVE */
                         | (1 << 4);  /* CCA — channel always clear */
            break;
        case RF_STATE_TX_CALIBR:
        case RF_STATE_TX:
        case RF_STATE_TX_FINAL:
            rf->fsmstat1 = (1 << 1); /* TX_ACTIVE */
            break;
        default:
            rf->fsmstat1 = 0;
            break;
    }
    rf->fsmstat0 = (uint32_t)state;
}

/* --- TX done event callback --- */

static void rfcore_tx_done(void *user_data, arm_event_t *ev) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    (void)ev;
    rf->rfirqf1 |= RFIRQF1_TXDONE;
    rfcore_check_interrupts(rf);
    /* CC2538 hardware: after TX, return to RX if RXENABLE is set */
    if (rf->rxenable) {
        rfcore_set_state(rf, RF_STATE_RX_CALIBR);
        rfcore_set_state(rf, RF_STATE_SFD_WAIT);
        rf->rx_frame_state = RF_RX_PREAMBLE;
        rf->zero_symbols = 0;
        /* Deliver any bytes that arrived during TX */
        if (rf->rx_incoming_len > 0) {
            int len = rf->rx_incoming_len;
            uint8_t buf[256];
            memcpy(buf, rf->rx_incoming, (size_t)len);
            rf->rx_incoming_len = 0;
            for (int i = 0; i < len; i++)
                cc2538_rfcore_receive_byte(rf, buf[i]);
        }
    } else {
        rfcore_set_state(rf, RF_STATE_IDLE);
    }
}

/* --- Strobes --- */

static void rfcore_strobe(cc2538_rfcore_t *rf, uint32_t strobe) {
    switch (strobe) {
        case CSP_ISRXON:
            rf->rxenable = 1;
            rf->software_off = false;
            rfcore_set_state(rf, RF_STATE_RX_CALIBR);
            /* Instant calibration for now (M3 will add timed transition) */
            rfcore_set_state(rf, RF_STATE_SFD_WAIT);
            /* Reset frame parsing state */
            rf->rx_frame_state = RF_RX_PREAMBLE;
            rf->zero_symbols = 0;
            /* Deliver any buffered incoming bytes */
            if (rf->rx_incoming_len > 0) {
                int len = rf->rx_incoming_len;
                uint8_t buf[256];
                memcpy(buf, rf->rx_incoming, (size_t)len);
                rf->rx_incoming_len = 0;
                for (int i = 0; i < len; i++)
                    cc2538_rfcore_receive_byte(rf, buf[i]);
            }
            break;

        case CSP_ISTXON: {
            rf->software_off = false;
            rfcore_set_state(rf, RF_STATE_TX_CALIBR);
            rfcore_set_state(rf, RF_STATE_TX);
#ifdef DEBUG
            /* Debug: dump TX frame */
            {
                fprintf(stderr, "[RF node%d] TX frame len=%d: ",
                        rf->node_id, rf->txfifo_len > 0 ? rf->txfifo[0] : 0);
                for (int k = 1; k < rf->txfifo_len && k < 21; k++)
                    fprintf(stderr, "%02x ", rf->txfifo[k]);
                fprintf(stderr, "...\n");
            }
#endif
            /* Emit 802.15.4 preamble + SFD, then TXFIFO bytes + auto-CRC */
            if (rf->tx_callback) {
                /* 4-byte preamble */
                for (int i = 0; i < PREAMBLE_MIN; i++)
                    rf->tx_callback(rf->tx_user_data, 0x00);
                /* SFD */
                rf->tx_callback(rf->tx_user_data, IEEE802154_SFD);
                /* TXFIFO data (length byte + payload) */
                for (int i = 0; i < rf->txfifo_len; i++)
                    rf->tx_callback(rf->tx_user_data, rf->txfifo[i]);
                /* Auto-append 2-byte FCS — compute CCITT CRC with bit
                 * reversal to match CC2420 wire format for mixed sims */
                if (rf->frmctrl0 & (1 << 6)) {
                    uint16_t crc = 0;
                    for (int i = 1; i < rf->txfifo_len; i++)
                        crc = crc_add_bitrev(crc, rf->txfifo[i]);
                    rf->tx_callback(rf->tx_user_data, bitrev((crc >> 8) & 0xFF));
                    rf->tx_callback(rf->tx_user_data, bitrev(crc & 0xFF));
                }
            }
            /* Schedule TX-done event: leave TX_ACTIVE set so firmware can
             * poll FSMSTAT1.TX_ACTIVE. The event fires after the over-the-air
             * transmission time and transitions to IDLE + TXDONE interrupt.
             * OTA time: (preamble+SFD+data+CRC) * 32µs/byte at 250kbps */
            {
                int ota_bytes = PREAMBLE_MIN + 1 + rf->txfifo_len + 2;
                int64_t tx_ns = (int64_t)ota_bytes * 32000; /* 32µs per byte */
                rf->txfifo_len = 0;
                arm_schedule_event_ns(rf->cpu, &rf->tx_event,
                                      rf->cpu->sim_time_ns + tx_ns);
            }
            break;
        }

