joakimeriksson/cooja-ng/src/arm/cc2538_rfcore.c
        case CSP_ISTXONCCA:
            /* Simplified: always transmit (CCA is M2 work) */
            rfcore_strobe(rf, CSP_ISTXON);
            break;

        case CSP_ISRFOFF:
            rf->rxenable = 0;
            rf->software_off = true;
            /* Don't actually go to IDLE — keep the RX frame parser
             * active so the simulation medium can deliver frames.
             * FSMSTAT0 reads will report IDLE when software_off is set. */
            break;

        case CSP_ISFLUSHRX:
            rf->rxfifo_len = 0;
            rf->rxfifo_rd = 0;
            /* Do NOT clear rx_incoming here: those are bytes from future
             * transmissions buffered because the radio was busy.  They
             * will be delivered when ISRXON is next called. */
            rf->rx_frame_state = RF_RX_PREAMBLE;
            rf->zero_symbols = 0;
            break;

        case CSP_ISFLUSHTX:
            rf->txfifo_len = 0;
            break;
    }
}

/* --- CC2538 Info Page (IEEE address at 0x00280028) --- */

#define CC2538_INFO_PAGE_BASE  0x00280000
#define CC2538_INFO_PAGE_SIZE  0x1000
#define CC2538_IEEE_ADDR_OFF   0x028   /* Primary IEEE address offset */

static int info_page_read(void *user_data, uint32_t addr) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - CC2538_INFO_PAGE_BASE;
    /* IEEE 64-bit address at offset 0x28-0x2F */
    if (offset >= CC2538_IEEE_ADDR_OFF && offset < CC2538_IEEE_ADDR_OFF + 8)
        return rf->ext_addr[offset - CC2538_IEEE_ADDR_OFF];
    return 0;
}

static void info_page_write(void *user_data, uint32_t addr, uint32_t value) {
    (void)user_data; (void)addr; (void)value;
    /* Info page is read-only */
}

/* --- FFSM registers (address matching, EXT_ADDR, SHORT_ADDR, PAN_ID) --- */

/* FFSM register offsets */
#define FFSM_PAN_ID0      0x098
#define FFSM_PAN_ID1      0x09C
#define FFSM_SHORT_ADDR0  0x0A0
#define FFSM_SHORT_ADDR1  0x0A4
#define FFSM_EXT_ADDR0    0x0A8
#define FFSM_EXT_ADDR1    0x0AC
#define FFSM_EXT_ADDR2    0x0B0
#define FFSM_EXT_ADDR3    0x0B4
#define FFSM_EXT_ADDR4    0x0B8
#define FFSM_EXT_ADDR5    0x0BC
#define FFSM_EXT_ADDR6    0x0C0
#define FFSM_EXT_ADDR7    0x0C4

static int ffsm_read(void *user_data, uint32_t addr) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_FFSM_BASE;

    switch (offset) {
        case FFSM_PAN_ID0:     return rf->pan_id & 0xFF;
        case FFSM_PAN_ID1:     return (rf->pan_id >> 8) & 0xFF;
        case FFSM_SHORT_ADDR0: return rf->short_addr & 0xFF;
        case FFSM_SHORT_ADDR1: return (rf->short_addr >> 8) & 0xFF;
        case FFSM_EXT_ADDR0:   return rf->ext_addr[0];
        case FFSM_EXT_ADDR1:   return rf->ext_addr[1];
        case FFSM_EXT_ADDR2:   return rf->ext_addr[2];
        case FFSM_EXT_ADDR3:   return rf->ext_addr[3];
        case FFSM_EXT_ADDR4:   return rf->ext_addr[4];
        case FFSM_EXT_ADDR5:   return rf->ext_addr[5];
        case FFSM_EXT_ADDR6:   return rf->ext_addr[6];
        case FFSM_EXT_ADDR7:   return rf->ext_addr[7];
        default: return 0;
    }
}

static void ffsm_write(void *user_data, uint32_t addr, uint32_t value) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_FFSM_BASE;

    switch (offset) {
        case FFSM_PAN_ID0:     rf->pan_id = (rf->pan_id & 0xFF00) | (value & 0xFF); break;
        case FFSM_PAN_ID1:     rf->pan_id = (rf->pan_id & 0x00FF) | ((value & 0xFF) << 8); break;
        case FFSM_SHORT_ADDR0: rf->short_addr = (rf->short_addr & 0xFF00) | (value & 0xFF); break;
        case FFSM_SHORT_ADDR1: rf->short_addr = (rf->short_addr & 0x00FF) | ((value & 0xFF) << 8); break;
        case FFSM_EXT_ADDR0:   rf->ext_addr[0] = (uint8_t)value; break;
        case FFSM_EXT_ADDR1:   rf->ext_addr[1] = (uint8_t)value; break;
        case FFSM_EXT_ADDR2:   rf->ext_addr[2] = (uint8_t)value; break;
        case FFSM_EXT_ADDR3:   rf->ext_addr[3] = (uint8_t)value; break;
        case FFSM_EXT_ADDR4:   rf->ext_addr[4] = (uint8_t)value; break;
        case FFSM_EXT_ADDR5:   rf->ext_addr[5] = (uint8_t)value; break;
        case FFSM_EXT_ADDR6:   rf->ext_addr[6] = (uint8_t)value; break;
        case FFSM_EXT_ADDR7:   rf->ext_addr[7] = (uint8_t)value; break;
    }
}

/* --- XREG registers --- */

static int xreg_read(void *user_data, uint32_t addr) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_XREG_BASE;

    switch (offset) {
        case RFCORE_XREG_FRMFILT0:  return (int)rf->frmfilt0;
        case RFCORE_XREG_FRMFILT1:  return (int)rf->frmfilt1;
        case RFCORE_XREG_SRCMATCH:  return (int)rf->srcmatch;
        case RFCORE_XREG_FRMCTRL0:  return (int)rf->frmctrl0;
        case RFCORE_XREG_FRMCTRL1:  return (int)rf->frmctrl1;
        case RFCORE_XREG_RXENABLE:  return (int)rf->rxenable;
        case RFCORE_XREG_FREQCTRL:  return (int)rf->freqctrl;
        case RFCORE_XREG_TXPOWER:   return (int)rf->txpower;
        case RFCORE_XREG_FSMSTAT0:
            return rf->software_off ? 0 : (int)rf->fsmstat0;
        case RFCORE_XREG_FSMSTAT1: {
            uint32_t val = rf->software_off ? 0 : rf->fsmstat1;
            /* FIFO (bit 7): RX FIFO has data */
            if (rf->rxfifo_rd < rf->rxfifo_len)
                val |= (1 << 7);
            /* FIFOP (bit 6): live status — complete frame available in FIFO.
             * Unlike the RFIRQF0.FIFOP interrupt flag (which gets cleared by
             * the ISR), this hardware signal stays high as long as there are
             * unread bytes in the RXFIFO. */
            if (rf->rxfifo_rd < rf->rxfifo_len)
                val |= (1 << 6);
            /* CCA (bit 4): always set — channel clear for simulation */
            val |= (1 << 4);
            return (int)val;
        }
        case RFCORE_XREG_FIFOPCTRL: return (int)rf->fifopctrl;
        case RFCORE_XREG_FSMCTRL:   return (int)rf->fsmctrl;
        case RFCORE_XREG_CCACTRL0:  return (int)rf->ccactrl0;
        case RFCORE_XREG_RSSI:      return (int)rf->rssi;
        case RFCORE_XREG_RFIRQM0:   return (int)rf->rfirqm0;
        case RFCORE_XREG_RFIRQM1:   return (int)rf->rfirqm1;
        case RFCORE_XREG_RFERRM:    return (int)rf->rferrm;
        case RFCORE_XREG_RFRND: {
            rf->rfrnd_state = rf->rfrnd_state * 1103515245 + 12345;
            return (int)((rf->rfrnd_state >> 16) & 3);
        }
        case RFCORE_XREG_RSSISTAT:  return 1; /* RSSI valid */
        case RFCORE_XREG_AGCCTRL1:  return (int)rf->agcctrl1;
        case RFCORE_XREG_TXFILTCFG: return (int)rf->txfiltcfg;
        default: return 0;
    }
}

static void xreg_write(void *user_data, uint32_t addr, uint32_t value) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_XREG_BASE;

    switch (offset) {
        case RFCORE_XREG_FRMFILT0:  rf->frmfilt0 = value; break;
        case RFCORE_XREG_FRMFILT1:  rf->frmfilt1 = value; break;
        case RFCORE_XREG_SRCMATCH:  rf->srcmatch = value; break;
        case RFCORE_XREG_FRMCTRL0:  rf->frmctrl0 = value; break;
        case RFCORE_XREG_FRMCTRL1:  rf->frmctrl1 = value; break;
        case RFCORE_XREG_RXENABLE:  rf->rxenable = value; break;
        case RFCORE_XREG_FREQCTRL:
            rf->freqctrl = value;
            rf->channel = ((value & 0x7F) - 11) / 5 + 11;
            break;
        case RFCORE_XREG_TXPOWER:   rf->txpower = value; break;
        case RFCORE_XREG_FIFOPCTRL: rf->fifopctrl = value; break;
        case RFCORE_XREG_FSMCTRL:   rf->fsmctrl = value; break;
        case RFCORE_XREG_CCACTRL0:  rf->ccactrl0 = value; break;
        case RFCORE_XREG_RFIRQM0:   rf->rfirqm0 = value; rfcore_check_interrupts(rf); break;
        case RFCORE_XREG_RFIRQM1:   rf->rfirqm1 = value; rfcore_check_interrupts(rf); break;
        case RFCORE_XREG_RFERRM:    rf->rferrm = value; rfcore_check_interrupts(rf); break;
        case RFCORE_XREG_AGCCTRL1:  rf->agcctrl1 = value; break;
        case RFCORE_XREG_TXFILTCFG: rf->txfiltcfg = value; break;
    }
}

/* --- SFR registers --- */

