joakimeriksson/cooja-ng/src/arm/cc2538_rfcore.c
static int sfr_read(void *user_data, uint32_t addr) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_SFR_BASE;

    switch (offset) {
        case RFCORE_SFR_MTCSPCFG: return (int)rf->mtcspcfg;
        case RFCORE_SFR_MTCTRL:   return (int)rf->mtctrl;
        case RFCORE_SFR_MTIRQM:   return (int)rf->mtirqm;
        case RFCORE_SFR_MTIRQF:   return (int)rf->mtirqf;
        case RFCORE_SFR_MTMSEL:   return (int)rf->mtmsel;
        case RFCORE_SFR_MTM0:
        case RFCORE_SFR_MTM1:
        case RFCORE_SFR_MTMOVF0:
        case RFCORE_SFR_MTMOVF1:
        case RFCORE_SFR_MTMOVF2: {
            /* MAC timer: 40-bit counter at 32.768 kHz derived from CPU cycles.
             * Use cycles directly (not sim_time_ns) since sim_time_ns may not
             * be synced during arm_step()-based execution. */
            int64_t ns = arm_cycles_to_ns(rf->cpu->cycles, rf->cpu->cpu_freq_hz);
            int64_t mt_ticks = ns / MT_PERIOD_NS;
            uint16_t mt_count = (uint16_t)(mt_ticks & 0xFFFF);
            uint32_t mt_ovf = (uint32_t)(mt_ticks >> 16);
            if (offset == RFCORE_SFR_MTM0)     return mt_count & 0xFF;
            if (offset == RFCORE_SFR_MTM1)     return (mt_count >> 8) & 0xFF;
            if (offset == RFCORE_SFR_MTMOVF0)  return mt_ovf & 0xFF;
            if (offset == RFCORE_SFR_MTMOVF1)  return (mt_ovf >> 8) & 0xFF;
            return (int)((mt_ovf >> 16) & 0xFF); /* MTMOVF2 */
        }
        case RFCORE_SFR_RFDATA: {
            if (rf->rxfifo_rd < rf->rxfifo_len) {
                uint8_t b = rf->rxfifo[rf->rxfifo_rd++];
                /* Auto-compact: when all bytes consumed, reclaim space.
                 * Real CC2538 RXFIFO is a circular buffer; consumed
                 * bytes are automatically freed.  The driver's read()
                 * does NOT call ISFLUSHRX after a successful read. */
                if (rf->rxfifo_rd >= rf->rxfifo_len) {
                    rf->rxfifo_rd = 0;
                    rf->rxfifo_len = 0;
                }
                return b;
            }
            return 0;
        }
        case RFCORE_SFR_RFERRF:   return (int)rf->rferrf;
        case RFCORE_SFR_RFIRQF0:
            return (int)rf->rfirqf0;
        case RFCORE_SFR_RFIRQF1:  return (int)rf->rfirqf1;
        case RFCORE_SFR_RFST:     return 0;
        default: return 0;
    }
}

static void sfr_write(void *user_data, uint32_t addr, uint32_t value) {
    cc2538_rfcore_t *rf = (cc2538_rfcore_t *)user_data;
    uint32_t offset = addr - RFCORE_SFR_BASE;

    switch (offset) {
        case RFCORE_SFR_MTCSPCFG: rf->mtcspcfg = value; break;
        case RFCORE_SFR_MTCTRL:   rf->mtctrl = value; break;
        case RFCORE_SFR_MTIRQM:   rf->mtirqm = value; break;
        case RFCORE_SFR_MTIRQF:   rf->mtirqf &= value; break; /* W0C */
        case RFCORE_SFR_MTMSEL:   rf->mtmsel = value; break;
        case RFCORE_SFR_MTM0:     rf->mtm0 = value; break;
        case RFCORE_SFR_MTM1:     rf->mtm1 = value; break;
        case RFCORE_SFR_MTMOVF0:  rf->mtmovf0 = value; break;
        case RFCORE_SFR_MTMOVF1:  rf->mtmovf1 = value; break;
        case RFCORE_SFR_MTMOVF2:  rf->mtmovf2 = value; break;
        case RFCORE_SFR_RFDATA:
            if (rf->txfifo_len < RF_FIFO_SIZE)
                rf->txfifo[rf->txfifo_len++] = (uint8_t)(value & 0xFF);
            break;
        case RFCORE_SFR_RFERRF:
            rf->rferrf &= value;    /* W0C: write-0-clears */
            rfcore_check_interrupts(rf);
            break;
        case RFCORE_SFR_RFIRQF0:
            rf->rfirqf0 &= value;   /* W0C: write-0-clears */
            rfcore_check_interrupts(rf);
            break;
        case RFCORE_SFR_RFIRQF1:
            rf->rfirqf1 &= value;   /* W0C: write-0-clears */
            rfcore_check_interrupts(rf);
            break;
        case RFCORE_SFR_RFST:
            rfcore_strobe(rf, value);
            break;
    }
}

/* --- Init --- */

void cc2538_rfcore_init(cc2538_rfcore_t *rf, arm_cpu_t *cpu, arm_nvic_t *nvic) {
    memset(rf, 0, sizeof(*rf));
    rf->cpu = cpu;
    rf->nvic = nvic;
    rf->state = RF_STATE_IDLE;
    rf->fifopctrl = 64;       /* Default FIFOP threshold */
    rf->frmfilt0 = 0x0D;      /* Frame filtering enabled by default */
    rf->frmctrl0 = 0x40;      /* AUTOACK enabled */
    rf->rssi = -128 & 0xFF;   /* No signal */
    rf->ccactrl0 = 0xF8;      /* Default CCA threshold */
    rf->agcctrl1 = 0x11;
    rf->txfiltcfg = 0x09;
    rf->txpower = 0xFF;        /* Max power */
    rf->rfrnd_state = 0xDEADBEEF;
    rf->rx_rssi = -50;  /* default RSSI (backward compatible) */

    rf->tx_event.callback = rfcore_tx_done;
    rf->tx_event.user_data = rf;

    arm_register_io(cpu, RFCORE_FFSM_BASE, RFCORE_FFSM_SIZE,
                    ffsm_read, ffsm_write, rf);
    arm_register_io(cpu, RFCORE_XREG_BASE, RFCORE_XREG_SIZE,
                    xreg_read, xreg_write, rf);
    arm_register_io(cpu, RFCORE_SFR_BASE, RFCORE_SFR_SIZE,
                    sfr_read, sfr_write, rf);
    arm_register_io(cpu, CC2538_INFO_PAGE_BASE, CC2538_INFO_PAGE_SIZE,
                    info_page_read, info_page_write, rf);
}

/* --- TX callback --- */

void cc2538_rfcore_set_tx_callback(cc2538_rfcore_t *rf,
                                   cc2538_rf_tx_fn cb, void *user_data) {
    rf->tx_callback = cb;
    rf->tx_user_data = user_data;
}

/* --- RX byte processing with 802.15.4 frame parsing --- */

void cc2538_rfcore_receive_byte(cc2538_rfcore_t *rf, uint8_t byte) {
    /* Only buffer during actual TX — cannot process while transmitting */
    if (rf->state == RF_STATE_TX || rf->state == RF_STATE_TX_CALIBR ||
        rf->state == RF_STATE_TX_FINAL) {
        if (rf->rx_incoming_len < 256)
            rf->rx_incoming[rf->rx_incoming_len++] = byte;
        return;
    }
    /* In all other states (including IDLE via software_off), process
     * frames directly.  This simulates perfect reception even when
     * the firmware has nominally turned the radio off (LPM). */

    switch (rf->rx_frame_state) {
        case RF_RX_PREAMBLE:
            if (byte == 0x00) {
                rf->zero_symbols++;
            } else if (rf->zero_symbols >= PREAMBLE_MIN && byte == IEEE802154_SFD) {
                /* Compact RXFIFO before new frame — reclaim consumed space.
                 * Real CC2538 has a circular FIFO; we simulate this by
                 * shifting remaining unread bytes to the front. */
                if (rf->rxfifo_rd > 0) {
                    int remaining = rf->rxfifo_len - rf->rxfifo_rd;
                    if (remaining > 0)
                        memmove(rf->rxfifo, rf->rxfifo + rf->rxfifo_rd,
                                (size_t)remaining);
                    rf->rxfifo_len = remaining;
                    rf->rxfifo_rd = 0;
                }
                /* SFD detected — transition to RX_FRAME */
                rfcore_set_state(rf, RF_STATE_RX);
                rf->rfirqf0 |= RFIRQF0_SFD;
                rfcore_check_interrupts(rf);
                rf->rx_frame_state = RF_RX_LENGTH;
            } else {
                /* Not a valid preamble sequence, reset */
                rf->zero_symbols = 0;
            }
            break;

        case RF_RX_LENGTH:
            rf->rxlen = byte;
            rf->rx_byte_count = 0;
            /* Write length byte to RXFIFO */
            if (rf->rxfifo_len < RF_FIFO_SIZE)
                rf->rxfifo[rf->rxfifo_len++] = byte;
            if (rf->rxlen == 0) {
                /* Empty frame — back to preamble search */
                rf->rx_frame_state = RF_RX_PREAMBLE;
                rf->zero_symbols = 0;
                rfcore_set_state(rf, RF_STATE_SFD_WAIT);
            } else {
                rf->rx_frame_state = RF_RX_PAYLOAD;
            }
            break;

        case RF_RX_PAYLOAD:
            /* Write byte to RXFIFO */
            if (rf->rxfifo_len < RF_FIFO_SIZE)
                rf->rxfifo[rf->rxfifo_len++] = byte;

            /* Extract frame header fields */
            if (rf->rx_byte_count == 0) {
                rf->rx_fcf0 = byte;
                rf->rx_ack_request = (byte >> 5) & 1;
            } else if (rf->rx_byte_count == 2) {
                rf->rx_dsn = byte;
            }

            rf->rx_byte_count++;

