joakimeriksson/cooja-ng/src/arm/cc2538_rfcore.c
            /* Check if frame is complete */
            if (rf->rx_byte_count >= rf->rxlen) {
                /* Frame complete.  On real CC2538 hardware the last two
                 * FCS bytes in RXFIFO are replaced with metadata:
                 *   byte N-1 = RSSI (signed, we use a fixed value)
                 *   byte N   = CRC_OK (bit 7) | CORR/LQI (bits 6:0)
                 * The firmware checks CRC_OK before accepting a frame. */
                if (rf->rxfifo_len >= 2) {
                    rf->rxfifo[rf->rxfifo_len - 2] = (uint8_t)(int8_t)rf->rx_rssi; /* RSSI */
                    /* Derive LQI from RSSI: map [-10..-90] -> [100..20]
                     * dist_ratio = -(rssi + 10) / 80; lqi = 100 - dist_ratio * 80 */
                    int lqi = (int)rf->rx_rssi + 110;
                    if (lqi < 20) lqi = 20;
                    if (lqi > 100) lqi = 100;
                    rf->rxfifo[rf->rxfifo_len - 1] = (uint8_t)(0x80 | (lqi & 0x7F)); /* CRC_OK | LQI */
                }

                rf->rfirqf0 |= RFIRQF0_RXPKTDONE | RFIRQF0_FIFOP;
#ifdef DEBUG
                /* Debug: dump received frame for RPL debugging */
                {
                    int start = rf->rxfifo_len - rf->rxlen;
                    fprintf(stderr, "[RF node%d] RX frame len=%d: ",
                            rf->node_id, rf->rxlen);
                    for (int k = start; k < rf->rxfifo_len; k++)
                        fprintf(stderr, "%02x ", rf->rxfifo[k]);
                    fprintf(stderr, "\n");
                }
#endif
                rfcore_check_interrupts(rf);

                /* Auto-ACK: if FRMCTRL0.AUTOACK (bit 5) is set and the
                 * received frame has ACK_REQUEST, transmit an ACK frame.
                 * ACK frame: preamble(4) + SFD(1) + len(1) + FCF(2) + DSN(1) + FCS(2) */
                if ((rf->frmctrl0 & (1 << 5)) && rf->rx_ack_request && rf->tx_callback) {
                    for (int i = 0; i < PREAMBLE_MIN; i++)
                        rf->tx_callback(rf->tx_user_data, 0x00);
                    rf->tx_callback(rf->tx_user_data, IEEE802154_SFD);
                    rf->tx_callback(rf->tx_user_data, 5);    /* length: FCF(2) + DSN(1) + FCS(2) */
                    uint8_t ack_fcf0 = 0x02; /* frame type = ACK */
                    uint8_t ack_fcf1 = 0x00;
                    uint8_t ack_dsn  = rf->rx_dsn;
                    rf->tx_callback(rf->tx_user_data, ack_fcf0);
                    rf->tx_callback(rf->tx_user_data, ack_fcf1);
                    rf->tx_callback(rf->tx_user_data, ack_dsn);
                    /* Compute FCS (CCITT CRC with bit reversal) */
                    uint16_t ack_crc = 0;
                    ack_crc = crc_add_bitrev(ack_crc, ack_fcf0);
                    ack_crc = crc_add_bitrev(ack_crc, ack_fcf1);
                    ack_crc = crc_add_bitrev(ack_crc, ack_dsn);
                    rf->tx_callback(rf->tx_user_data, bitrev((ack_crc >> 8) & 0xFF));
                    rf->tx_callback(rf->tx_user_data, bitrev(ack_crc & 0xFF));
                    rf->rfirqf1 |= RFIRQF1_TXACKDONE;
                    rfcore_check_interrupts(rf);
                }

                /* Reset for next frame */
                rf->rx_frame_state = RF_RX_PREAMBLE;
                rf->zero_symbols = 0;
                rfcore_set_state(rf, RF_STATE_SFD_WAIT);
            }
            break;
    }
}
